---
kind: property
id: P:Autodesk.Revit.DB.IntersectionResult.Distance
source: html/d96f953c-544c-33a5-1265-c5d48f49766b.htm
---
# Autodesk.Revit.DB.IntersectionResult.Distance Property

Distance from the original object to located point.

## Syntax (C#)
```csharp
public double Distance { get; internal set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown in the getter when this property has not been set by the method providing the result.